modules/exwm/freemacs-exwm.org
# -*-eval: (add-hook 'after-save-hook (lambda ()(org-babel-tangle)) nil t);-*-

#+title:Emacs Desktop Configuration
#+author: Thomas Freeman
#+date: Time-stamp: <2022-07-07 17:21:27 thomas>
#+language: en_US
#+property: header-args :results silent :exports code

#+options: html-link-use-abs-url:nil html-postamble:auto
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t num:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+keywords: Emacs
#+html_link_home: ../../index.html
#+html_link_up: ../../init.html
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)
#+html_head: <style>#org-div-home-and-up { text-align: right; padding-right: 10pt; }</style>

#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup



* Emacs Desktop

When there is no window manager running, Emacs can run as a window manger using [[https://github.com/ch11ng/exwm][EXWM]]. This makes for a very lean desktop environment where all programs-including X11 applications-are run in Emacs windows and can be controlled by commands that control Emacs windows. Emacs Desktop also adds some extra convenience features.

** Check for Window Manager

I generally only want to use [[https://github.com/ch11ng/exwm][EXWM]] when I do not have another window manger in place. The following check will use ~wmctrl -m~ to check if there is an active window manager running. If it finds a window manager running, the exit code will be 0. If not, the exit code will be 1. Calling ~echo $?~ immediately afterward with ~shell-command-to-string~ will return the exit code appended to the end of the output from ~wmctrl -m~. As we only care about the status of the exit code, we can call on the ~substring~ function to get just the exit code and not the whole output of the command.

There is also a check for the X window system as calling GUI programs from [[https://github.com/ch11ng/exwm][EXWM]] will not work without it.

#+begin_src emacs-lisp :noweb-ref win_man_check
  (and (window-system)
       (not
        (string=
         (substring
          (shell-command-to-string
           (whicher "wmctrl -m ; echo $status"))
          -2 -1) "0")))
#+end_src

** App Launcher

Use App Launcher to launch Linux applications in [[https://github.com/ch11ng/exwm][EXWM]]. App Launcher will scan for all ~*.desktop~ files in the application directories on Linux and provide a list of candidates that can be filtered with completion.

#+begin_src emacs-lisp :tangle yes
  (use-package app-launcher
    :straight '(app-launcher :host github
                             :repo "tfree87/app-launcher"
                             :branch "symlink")
    :commands (app-launcher-run-app))
#+end_src

*** TODO Create a fork of app-launcher and add support for Windows applications using the Windows start menu shortcuts directory

** EXWM :guix:

[[https://github.com/ch11ng/exwm][EXWM]] stands for the "Emacs X11 Window Manager". With this package, Emacs can run X11 programs in windows and frames and controlled with Emacs window commands. To use [[https://github.com/ch11ng/exwm][EXWM]], the [[https://github.com/ch11ng/exwm][EXWM]] package can be pulled from using ~straight.el~.

Currently, I only use EXWM on my GUIX systems to I do not use straight or use-package to manage this package.

#+begin_src emacs-lisp :tangle yes :noweb yes
  (use-package exwm
    :if
    <<win_man_check>>
    :custom
    <<exwm_custom>>
    :config
    <<exwm_config>>
    (exwm-init))
#+end_src

