docs/modules/exwm/freemacs-exwm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en_US" xml:lang="en_US">
<head>
<!-- 2022-07-07 Thu 20:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Desktop Configuration</title>
<meta name="author" content="Thomas Freeman" />
<meta name="keywords" content="Emacs" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../init.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Emacs Desktop Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org26301db">Emacs Desktop</a>
<ul>
<li><a href="#orga0a5789">Check for Window Manager</a></li>
<li><a href="#org6f71547">App Launcher</a>
<ul>
<li><a href="#org1c01f7d"><span class="todo TODO">TODO</span> Create a fork of app-launcher and add support for Windows applications using the Windows start menu shortcuts directory</a></li>
</ul>
</li>
<li><a href="#orge9c66b8">EXWM&#xa0;&#xa0;&#xa0;<span class="tag"><span class="guix">guix</span></span></a>
<ul>
<li><a href="#org66107d8">Buffer Naming</a></li>
<li><a href="#orgb9e23c6">Default Workspaces</a></li>
<li><a href="#orgcd189ef">Keys</a></li>
<li><a href="#orga0f7b39">RandR</a></li>
<li><a href="#orgb4bdce4">SystemTray</a></li>
<li><a href="#org7f75699">EXWM Startup Programs</a></li>
</ul>
</li>
<li><a href="#org353adca">Desktop Environment</a></li>
</ul>
</li>
<li><a href="#org662b61b">End</a></li>
</ul>
</div>
</div>
<hr />


<div id="outline-container-org26301db" class="outline-2">
<h2 id="org26301db">Emacs Desktop</h2>
<div class="outline-text-2" id="text-org26301db">
<p>
When there is no window manager running, Emacs can run as a window manger using <a href="https://github.com/ch11ng/exwm">EXWM</a>. This makes for a very lean desktop environment where all programs-including X11 applications-are run in Emacs windows and can be controlled by commands that control Emacs windows. Emacs Desktop also adds some extra convenience features.
</p>
</div>

<div id="outline-container-orga0a5789" class="outline-3">
<h3 id="orga0a5789">Check for Window Manager</h3>
<div class="outline-text-3" id="text-orga0a5789">
<p>
I generally only want to use <a href="https://github.com/ch11ng/exwm">EXWM</a> when I do not have another window manger in place. The following check will use <code>wmctrl -m</code> to check if there is an active window manager running. If it finds a window manager running, the exit code will be 0. If not, the exit code will be 1. Calling <code>echo $?</code> immediately afterward with <code>shell-command-to-string</code> will return the exit code appended to the end of the output from <code>wmctrl -m</code>. As we only care about the status of the exit code, we can call on the <code>substring</code> function to get just the exit code and not the whole output of the command.
</p>

<p>
There is also a check for the X window system as calling GUI programs from <a href="https://github.com/ch11ng/exwm">EXWM</a> will not work without it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">and</span> <span style="color: #ff2afc;">(</span>window-system<span style="color: #ff2afc;">)</span>
     <span style="color: #ff2afc;">(</span>not
      <span style="color: #a7da1e;">(</span>string=
       <span style="color: #df85ff;">(</span>substring
        <span style="color: #A875FF;">(</span>shell-command-to-string
         <span style="color: #1ea8fc;">(</span>whicher <span style="color: #7984D1;">"wmctrl -m ; echo $status"</span><span style="color: #1ea8fc;">)</span><span style="color: #A875FF;">)</span>
        -2 -1<span style="color: #df85ff;">)</span> <span style="color: #ffd400;">"0"</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6f71547" class="outline-3">
<h3 id="org6f71547">App Launcher</h3>
<div class="outline-text-3" id="text-org6f71547">
<p>
Use App Launcher to launch Linux applications in <a href="https://github.com/ch11ng/exwm">EXWM</a>. App Launcher will scan for all <code>*.desktop</code> files in the application directories on Linux and provide a list of candidates that can be filtered with completion.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">app-launcher</span>
  <span style="color: #1ea8fc;">:straight</span> '<span style="color: #ff2afc;">(</span>app-launcher <span style="color: #1ea8fc;">:host</span> github
                           <span style="color: #1ea8fc;">:repo</span> <span style="color: #7984D1;">"tfree87/app-launcher"</span>
                           <span style="color: #1ea8fc;">:branch</span> <span style="color: #7984D1;">"symlink"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:commands</span> <span style="color: #ff2afc;">(</span>app-launcher-run-app<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>

<div id="outline-container-org1c01f7d" class="outline-4">
<h4 id="org1c01f7d"><span class="todo TODO">TODO</span> Create a fork of app-launcher and add support for Windows applications using the Windows start menu shortcuts directory</h4>
</div>
</div>

<div id="outline-container-orge9c66b8" class="outline-3">
<h3 id="orge9c66b8">EXWM&#xa0;&#xa0;&#xa0;<span class="tag"><span class="guix">guix</span></span></h3>
<div class="outline-text-3" id="text-orge9c66b8">
<p>
<a href="https://github.com/ch11ng/exwm">EXWM</a> stands for the "Emacs X11 Window Manager". With this package, Emacs can run X11 programs in windows and frames and controlled with Emacs window commands. To use <a href="https://github.com/ch11ng/exwm">EXWM</a>, the <a href="https://github.com/ch11ng/exwm">EXWM</a> package can be pulled from using <code>straight.el</code>.
</p>

<p>
Currently, I only use EXWM on my GUIX systems to I do not use straight or use-package to manage this package.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">exwm</span>
  <span style="color: #1ea8fc;">:if</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">and</span> <span style="color: #a7da1e;">(</span>window-system<span style="color: #a7da1e;">)</span>
       <span style="color: #a7da1e;">(</span>not
        <span style="color: #df85ff;">(</span>string=
         <span style="color: #A875FF;">(</span>substring
          <span style="color: #1ea8fc;">(</span>shell-command-to-string
           <span style="color: #ff2afc;">(</span>whicher <span style="color: #7984D1;">"wmctrl -m ; echo $status"</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
          -2 -1<span style="color: #A875FF;">)</span> <span style="color: #ffd400;">"0"</span><span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:custom</span>
  <span style="color: #ff2afc;">(</span>exwm-workspace-number 1<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>exwm-input-global-keys
   `<span style="color: #a7da1e;">(</span><span style="color: #df85ff;">(</span><span style="color: #A875FF;">[</span>?\s-r<span style="color: #A875FF;">]</span> . exwm-reset<span style="color: #df85ff;">)</span>
     <span style="color: #df85ff;">(</span><span style="color: #A875FF;">[</span>s-left<span style="color: #A875FF;">]</span> . windmove-left<span style="color: #df85ff;">)</span>
     <span style="color: #df85ff;">(</span><span style="color: #A875FF;">[</span>s-right<span style="color: #A875FF;">]</span> . windmove-right<span style="color: #df85ff;">)</span>
     <span style="color: #df85ff;">(</span><span style="color: #A875FF;">[</span>s-up<span style="color: #A875FF;">]</span> . windmove-up<span style="color: #df85ff;">)</span>
     <span style="color: #df85ff;">(</span><span style="color: #A875FF;">[</span>s-down<span style="color: #A875FF;">]</span> . windmove-down<span style="color: #df85ff;">)</span>
     <span style="color: #df85ff;">(</span><span style="color: #A875FF;">[</span>?\s-w<span style="color: #A875FF;">]</span> . exwm-workspace-switch<span style="color: #df85ff;">)</span>
     <span style="color: #df85ff;">(</span><span style="color: #A875FF;">[</span>?\s-e<span style="color: #A875FF;">]</span> . app-launcher-run-app<span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>exwm-input-prefix-keys
   '<span style="color: #a7da1e;">(</span>?\C-x
     ?\C-u
     ?\C-h
     ?\M-x
     ?\M-`
     ?\M-&amp;
     ?\M-:
     ?\C-\M-j
     ?\C-\ <span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:config</span>
  <span style="color: #ff2afc;">(</span>add-hook
