modules/exwm/freemacs-exwm.el
(use-package app-launcher
  :straight '(app-launcher :host github
                           :repo "tfree87/app-launcher"
                           :branch "symlink")
  :commands (app-launcher-run-app))

(use-package exwm
  :if
  (and (window-system)
       (not
        (string=
         (substring
          (shell-command-to-string
           (whicher "wmctrl -m ; echo $status"))
          -2 -1) "0")))
  :custom
