modules/exwm/freemacs-exwm.org
*** Buffer Naming

To name buffers based on the application that was launched to create them, the following code must be used:

#+begin_src emacs-lisp :noweb-ref exwm_config
  (add-hook
   'exwm-update-class-hook (lambda()
                             (exwm-workspace-rename-buffer
                              exwm-class-name)))
#+end_src

*** Default Workspaces

With only a single monitor at the moment I only see the need for a single workspace as I can switch between tasks by switching buffers. This number should be increased with more monitors, however, as each workspace can display in a separate monitor and switching can then be done easily with the keyboard.

#+begin_src emacs-lisp :noweb-ref exwm_custom
  (exwm-workspace-number 1)
#+end_src

*** Keys

It is extremely helpful to set up special keybindings for use in [[https://github.com/ch11ng/exwm][EXWM]] due to the fact that X11 applications won't see keyboard commands that are first intercepted by Emacs.

**** Global Keys

These key bindings will always work, regardless of whether the current buffer is in ~char-mode~ or ~line-mode~. Since these keybindings always work, it is best to use a prefix key such as the ~super~ key.

#+begin_src emacs-lisp :noweb yes :noweb-ref exwm_custom
  (exwm-input-global-keys
   `(<<char_line_switch>>
     <<window_switching>>
     <<launch>>))
#+end_src

***** Launching Programs

The following command can be used to launch programs in EWXM by using the command ~s-e~. This will call the ~app-launcher-run-app~ function from the [[App Launcher]] package.

#+begin_src emacs-lisp :noweb-ref launch
  ([?\s-e] . app-launcher-run-app)
#+end_src

***** Moving

To have a universal command to switch between windows in [[https://github.com/ch11ng/exwm][EXWM]], the super key and the arrow keys can be used to move about the windows directionally. Normally, using the super key in a desktop environment such as Gnome or XFCE would open an application launcher but in EXWM it is free for our use.  

#+begin_src emacs-lisp :noweb-ref window_switching
  ([s-left] . windmove-left)
  ([s-right] . windmove-right)
  ([s-up] . windmove-up)
  ([s-down] . windmove-down)
#+end_src

The following command can also be used to select a workspace if multiple workspaces are created.

#+begin_src emacs-lisp :noweb-ref window_switching
  ([?\s-w] . exwm-workspace-switch)
#+end_src

***** Switching Between ~char-mode~ and ~line-mode~

When using [[https://github.com/ch11ng/exwm][EXWM]], opening an X11 application will load in ~line-mode~ by default. This means that switching to a buffer containing an X11 application such (e.g. Firefox), that ~C-c~ will act as an Emacs prefix command. Pressing ~C-c C-k~ will switch to ~char-mode~ and ~C-c~ will then do the usual copy command. Pressing ~s-r~ retruns back to ~line-mode~.

#+begin_src emacs-lisp :noweb yes :noweb-ref char_line_switch
  ([?\s-r] . exwm-reset)
#+end_src

**** ~input-send-next-key~

Any keys that Emacs recognizes as a prefix key, will not be passed to any underlying X11 applications running in an Emacs window. If a specific key (i.e. ~C-c~ for copy) needs to be sent to the X11 application, a prefix key can be set as ~exwm-input-send-next-key~ and issued before calling the key.

For example, to copy and paste from an X11 application running in an Emacs window, one could press ~C-q C-c~ to copy text and ~C-q C-v~ to paste text.

#+begin_src emacs-lisp :noweb-ref exwm_config
(define-key exwm-mode-map [?\C-q] 'exwm-input-send-next-key)
#+end_src

