docs/modules/exwm/freemacs-exwm.html
   'exwm-update-class-hook <span style="color: #a7da1e;">(</span><span style="color: #ff2afc; font-weight: bold;">lambda</span><span style="color: #df85ff;">()</span>
                             <span style="color: #df85ff;">(</span>exwm-workspace-rename-buffer
                              exwm-class-name<span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>define-key exwm-mode-map <span style="color: #a7da1e;">[</span>?\C-q<span style="color: #a7da1e;">]</span> 'exwm-input-send-next-key<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">exwm-randr</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>exwm-randr-enable<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">exwm-systemtray</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>exwm-systemtray-enable<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>whicher <span style="color: #7984D1;">"nm-applet"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">when</span> <span style="color: #a7da1e;">(</span>executable-find <span style="color: #7984D1;">"nm-applet"</span><span style="color: #a7da1e;">)</span>
    <span style="color: #a7da1e;">(</span>start-process-shell-command <span style="color: #7984D1;">"nm-applet"</span> nil <span style="color: #7984D1;">"nm-applet"</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>whicher <span style="color: #7984D1;">"pasystray"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">when</span> <span style="color: #a7da1e;">(</span>executable-find <span style="color: #7984D1;">"pasystray"</span><span style="color: #a7da1e;">)</span>
    <span style="color: #a7da1e;">(</span>start-process-shell-command <span style="color: #7984D1;">"pasystray"</span> nil <span style="color: #7984D1;">"pasystray"</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>whicher <span style="color: #7984D1;">"xsettingsd"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">when</span> <span style="color: #a7da1e;">(</span>executable-find <span style="color: #7984D1;">"xsettingsd"</span><span style="color: #a7da1e;">)</span>
    <span style="color: #a7da1e;">(</span>start-process-shell-command <span style="color: #7984D1;">"xsettingsd"</span> nil <span style="color: #7984D1;">"xsettingsd"</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>exwm-init<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>

<div id="outline-container-org66107d8" class="outline-4">
<h4 id="org66107d8">Buffer Naming</h4>
<div class="outline-text-4" id="text-org66107d8">
<p>
To name buffers based on the application that was launched to create them, the following code must be used:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>add-hook
 'exwm-update-class-hook <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">lambda</span><span style="color: #a7da1e;">()</span>
                           <span style="color: #a7da1e;">(</span>exwm-workspace-rename-buffer
                            exwm-class-name<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb9e23c6" class="outline-4">
<h4 id="orgb9e23c6">Default Workspaces</h4>
<div class="outline-text-4" id="text-orgb9e23c6">
<p>
With only a single monitor at the moment I only see the need for a single workspace as I can switch between tasks by switching buffers. This number should be increased with more monitors, however, as each workspace can display in a separate monitor and switching can then be done easily with the keyboard.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>exwm-workspace-number 1<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd189ef" class="outline-4">
<h4 id="orgcd189ef">Keys</h4>
<div class="outline-text-4" id="text-orgcd189ef">
<p>
It is extremely helpful to set up special keybindings for use in <a href="https://github.com/ch11ng/exwm">EXWM</a> due to the fact that X11 applications won't see keyboard commands that are first intercepted by Emacs.
</p>
</div>

<ul class="org-ul">
<li><a id="org2c4fe0a"></a>Global Keys<br />
<div class="outline-text-5" id="text-org2c4fe0a">
<p>
These key bindings will always work, regardless of whether the current buffer is in <code>char-mode</code> or <code>line-mode</code>. Since these keybindings always work, it is best to use a prefix key such as the <code>super</code> key.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>exwm-input-global-keys
 `<span style="color: #ff2afc;">(</span><span style="color: #a7da1e;">(</span><span style="color: #df85ff;">[</span>?\s-r<span style="color: #df85ff;">]</span> . exwm-reset<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span><span style="color: #df85ff;">[</span>s-left<span style="color: #df85ff;">]</span> . windmove-left<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span><span style="color: #df85ff;">[</span>s-right<span style="color: #df85ff;">]</span> . windmove-right<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span><span style="color: #df85ff;">[</span>s-up<span style="color: #df85ff;">]</span> . windmove-up<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span><span style="color: #df85ff;">[</span>s-down<span style="color: #df85ff;">]</span> . windmove-down<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span><span style="color: #df85ff;">[</span>?\s-w<span style="color: #df85ff;">]</span> . exwm-workspace-switch<span style="color: #a7da1e;">)</span>
   <span style="color: #a7da1e;">(</span><span style="color: #df85ff;">[</span>?\s-e<span style="color: #df85ff;">]</span> . app-launcher-run-app<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>

<ul class="org-ul">
<li><a id="orgfc9bce9"></a>Launching Programs<br />
<div class="outline-text-6" id="text-orgfc9bce9">
<p>
The following command can be used to launch programs in EWXM by using the command <code>s-e</code>. This will call the <code>app-launcher-run-app</code> function from the <a href="#org6f71547">App Launcher</a> package.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc;">[</span>?\s-e<span style="color: #ff2afc;">]</span> . app-launcher-run-app<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org840cb6f"></a>Moving<br />
<div class="outline-text-6" id="text-org840cb6f">
<p>
To have a universal command to switch between windows in <a href="https://github.com/ch11ng/exwm">EXWM</a>, the super key and the arrow keys can be used to move about the windows directionally. Normally, using the super key in a desktop environment such as Gnome or XFCE would open an application launcher but in EXWM it is free for our use.  
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc;">[</span>s-left<span style="color: #ff2afc;">]</span> . windmove-left<span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc;">[</span>s-right<span style="color: #ff2afc;">]</span> . windmove-right<span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc;">[</span>s-up<span style="color: #ff2afc;">]</span> . windmove-up<span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc;">[</span>s-down<span style="color: #ff2afc;">]</span> . windmove-down<span style="color: #1ea8fc;">)</span>
</pre>
</div>

<p>
The following command can also be used to select a workspace if multiple workspaces are created.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc;">[</span>?\s-w<span style="color: #ff2afc;">]</span> . exwm-workspace-switch<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org9296583"></a>Switching Between <code>char-mode</code> and <code>line-mode</code><br />
<div class="outline-text-6" id="text-org9296583">
<p>
When using <a href="https://github.com/ch11ng/exwm">EXWM</a>, opening an X11 application will load in <code>line-mode</code> by default. This means that switching to a buffer containing an X11 application such (e.g. Firefox), that <code>C-c</code> will act as an Emacs prefix command. Pressing <code>C-c C-k</code> will switch to <code>char-mode</code> and <code>C-c</code> will then do the usual copy command. Pressing <code>s-r</code> retruns back to <code>line-mode</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc;">[</span>?\s-r<span style="color: #ff2afc;">]</span> . exwm-reset<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</li>

<li><a id="org73bb28e"></a><code>input-send-next-key</code><br />
<div class="outline-text-5" id="text-org73bb28e">
<p>
Any keys that Emacs recognizes as a prefix key, will not be passed to any underlying X11 applications running in an Emacs window. If a specific key (i.e. <code>C-c</code> for copy) needs to be sent to the X11 application, a prefix key can be set as <code>exwm-input-send-next-key</code> and issued before calling the key.
</p>

<p>
For example, to copy and paste from an X11 application running in an Emacs window, one could press <code>C-q C-c</code> to copy text and <code>C-q C-v</code> to paste text.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>define-key exwm-mode-map <span style="color: #ff2afc;">[</span>?\C-q<span style="color: #ff2afc;">]</span> 'exwm-input-send-next-key<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</li>
