modules/exwm/freemacs-exwm.org
**** Input Prefix

Setting ~exwm-input-prefix-keys~ will cause those keys to be passed directly to Emacs to be processed. These keys will not be passed to any app unless they are proceeded by the ~exwm-input-send-next-key~.

#+begin_src emacs-lisp :noweb-ref exwm_custom
  (exwm-input-prefix-keys
   '(?\C-x
     ?\C-u
     ?\C-h
     ?\M-x
     ?\M-`
     ?\M-&
     ?\M-:
     ?\C-\M-j
     ?\C-\ ))
#+end_src

*** RandR

For multi-screen displays, ~exwm-randr~ must be enabled.

#+begin_src emacs-lisp :noweb-ref exwm_config
  (require 'exwm-randr)
  (exwm-randr-enable)
#+end_src

*** SystemTray

Make sure to turn on the system tray in [[https://github.com/ch11ng/exwm][EXWM]] so that there is access to tray icons.

#+begin_src emacs-lisp :noweb-ref exwm_config
  (require 'exwm-systemtray)
  (exwm-systemtray-enable)
#+end_src

*** EXWM Startup Programs

To make EXWM a fully functioning desktop evironment, a few startup programs will need to be run to make it able to function as a replacement to modern desktop environments such as Gnome:

1. To enable a wifi applet in the ~exwm-system-tray~ for easily controlling the wifi, Emacs can execute the ~nm-applet~ if it is installed.

   #+begin_src emacs-lisp :noweb-ref exwm_config
  (whicher "nm-applet")
  (when (executable-find "nm-applet")
    (start-process-shell-command "nm-applet" nil "nm-applet"))
#+end_src

2. To get sound in [[https://github.com/ch11ng/exwm][EXWM]], pulseaudio needs to be running. Killing pulseaudio and restarting seems to be the most effective at ensuring audio in [[https://github.com/ch11ng/exwm][EXWM]] if there are multiple desktop enviroments installed on the system.

   #+begin_src emacs-lisp :noweb-ref de_config
     (shell-command "pulseaudio --kill ; pulseaudio --start")
   #+end_src

3. Use ~pasystray~ for controlling volume graphically in [[https://github.com/ch11ng/exwm][EXWM]].

   #+begin_src emacs-lisp :noweb-ref exwm_config
  (whicher "pasystray")
  (when (executable-find "pasystray")
    (start-process-shell-command "pasystray" nil "pasystray"))
#+end_src

4. If the numpad is to be used for numbers, ~numlockx~ must be installed and turned on.

   #+begin_src emacs-lisp :noweb-ref de_config
     (shell-command "numlockx on")
   #+end_src

5. If the system is a laptop, tunring on tap to click can be activated.

   #+begin_src emacs-lisp :noweb-ref de_config
     (shell-command "xinput set-prop \"SynPS/2 Synaptics TouchPad\" \"libinput Tapping Enabled\" 1")
   #+end_src

6. Lastly, ~xsettingsd~ can be used to set the theme, and other settings for GTK+ applications.

   #+begin_src emacs-lisp :noweb-ref exwm_config
  (whicher "xsettingsd")
  (when (executable-find "xsettingsd")
    (start-process-shell-command "xsettingsd" nil "xsettingsd"))
#+end_src
   
** Desktop Environment

The [[https://github.com/DamienCassou/desktop-environment][Desktop Environment]] package makes it so that some of the features that are included in a typical desktop environment system are included in [[https://github.com/ch11ng/exwm][EXWM]]. This includes features such as access to media buttons, a screen locker, and adjustable brightness from the keyboard.

Currently, as I only use the Emacs Desktop Environment on my GUIX Systems, I do not have it managed by straight or use-package but rather by GUIX.

#+begin_src emacs-lisp :tangle yes :noweb yes
  (use-package desktop-environment
    :straight nil
    :after exwm
    :init
    (mapc #'whicher '("amixer"
                      "brightnessctl"
                      "numlockx"
                      "scrot"
                      "slock"
                      "upower"
                      "TLP"
                      "playerctl"))
    :config
    (desktop-environment-mode)
    <<de_config>>)
#+end_src

Instead of using ~scrot~ for screenshots, I prefer to use Flameshot.

#+begin_src emacs-lisp :noweb-ref de_config
  (when (executable-find "flameshot")
    (start-process-shell-command "flameshot" nil "flameshot"))
#+end_src

