docs/modules/exwm/freemacs-exwm.html

<li><a id="org14c91fd"></a>Input Prefix<br />
<div class="outline-text-5" id="text-org14c91fd">
<p>
Setting <code>exwm-input-prefix-keys</code> will cause those keys to be passed directly to Emacs to be processed. These keys will not be passed to any app unless they are proceeded by the <code>exwm-input-send-next-key</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>exwm-input-prefix-keys
 '<span style="color: #ff2afc;">(</span>?\C-x
   ?\C-u
   ?\C-h
   ?\M-x
   ?\M-`
   ?\M-&amp;
   ?\M-:
   ?\C-\M-j
   ?\C-\ <span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-orga0f7b39" class="outline-4">
<h4 id="orga0f7b39">RandR</h4>
<div class="outline-text-4" id="text-orga0f7b39">
<p>
For multi-screen displays, <code>exwm-randr</code> must be enabled.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">exwm-randr</span><span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span>exwm-randr-enable<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb4bdce4" class="outline-4">
<h4 id="orgb4bdce4">SystemTray</h4>
<div class="outline-text-4" id="text-orgb4bdce4">
<p>
Make sure to turn on the system tray in <a href="https://github.com/ch11ng/exwm">EXWM</a> so that there is access to tray icons.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">exwm-systemtray</span><span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span>exwm-systemtray-enable<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7f75699" class="outline-4">
<h4 id="org7f75699">EXWM Startup Programs</h4>
<div class="outline-text-4" id="text-org7f75699">
<p>
To make EXWM a fully functioning desktop evironment, a few startup programs will need to be run to make it able to function as a replacement to modern desktop environments such as Gnome:
</p>

<ol class="org-ol">
<li><p>
To enable a wifi applet in the <code>exwm-system-tray</code> for easily controlling the wifi, Emacs can execute the <code>nm-applet</code> if it is installed.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>whicher <span style="color: #7984D1;">"nm-applet"</span><span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">when</span> <span style="color: #ff2afc;">(</span>executable-find <span style="color: #7984D1;">"nm-applet"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>start-process-shell-command <span style="color: #7984D1;">"nm-applet"</span> nil <span style="color: #7984D1;">"nm-applet"</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div></li>

<li><p>
To get sound in <a href="https://github.com/ch11ng/exwm">EXWM</a>, pulseaudio needs to be running. Killing pulseaudio and restarting seems to be the most effective at ensuring audio in <a href="https://github.com/ch11ng/exwm">EXWM</a> if there are multiple desktop enviroments installed on the system.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>shell-command <span style="color: #7984D1;">"pulseaudio --kill ; pulseaudio --start"</span><span style="color: #1ea8fc;">)</span>
</pre>
</div></li>

<li><p>
Use <code>pasystray</code> for controlling volume graphically in <a href="https://github.com/ch11ng/exwm">EXWM</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>whicher <span style="color: #7984D1;">"pasystray"</span><span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">when</span> <span style="color: #ff2afc;">(</span>executable-find <span style="color: #7984D1;">"pasystray"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>start-process-shell-command <span style="color: #7984D1;">"pasystray"</span> nil <span style="color: #7984D1;">"pasystray"</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div></li>

<li><p>
If the numpad is to be used for numbers, <code>numlockx</code> must be installed and turned on.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>shell-command <span style="color: #7984D1;">"numlockx on"</span><span style="color: #1ea8fc;">)</span>
</pre>
</div></li>

<li><p>
If the system is a laptop, tunring on tap to click can be activated.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>shell-command <span style="color: #7984D1;">"xinput set-prop \"SynPS/2 Synaptics TouchPad\" \"libinput Tapping Enabled\" 1"</span><span style="color: #1ea8fc;">)</span>
</pre>
</div></li>

<li><p>
Lastly, <code>xsettingsd</code> can be used to set the theme, and other settings for GTK+ applications.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>whicher <span style="color: #7984D1;">"xsettingsd"</span><span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">when</span> <span style="color: #ff2afc;">(</span>executable-find <span style="color: #7984D1;">"xsettingsd"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>start-process-shell-command <span style="color: #7984D1;">"xsettingsd"</span> nil <span style="color: #7984D1;">"xsettingsd"</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org353adca" class="outline-3">
<h3 id="org353adca">Desktop Environment</h3>
<div class="outline-text-3" id="text-org353adca">
<p>
The <a href="https://github.com/DamienCassou/desktop-environment">Desktop Environment</a> package makes it so that some of the features that are included in a typical desktop environment system are included in <a href="https://github.com/ch11ng/exwm">EXWM</a>. This includes features such as access to media buttons, a screen locker, and adjustable brightness from the keyboard.
</p>

<p>
Currently, as I only use the Emacs Desktop Environment on my GUIX Systems, I do not have it managed by straight or use-package but rather by GUIX.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">desktop-environment</span>
  <span style="color: #1ea8fc;">:straight</span> nil
  <span style="color: #1ea8fc;">:after</span> exwm
  <span style="color: #1ea8fc;">:init</span>
  <span style="color: #ff2afc;">(</span>mapc #'whicher '<span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"amixer"</span>
                    <span style="color: #7984D1;">"brightnessctl"</span>
                    <span style="color: #7984D1;">"numlockx"</span>
                    <span style="color: #7984D1;">"scrot"</span>
                    <span style="color: #7984D1;">"slock"</span>
                    <span style="color: #7984D1;">"upower"</span>
                    <span style="color: #7984D1;">"TLP"</span>
                    <span style="color: #7984D1;">"playerctl"</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:config</span>
  <span style="color: #ff2afc;">(</span>desktop-environment-mode<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>shell-command <span style="color: #7984D1;">"pulseaudio --kill ; pulseaudio --start"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>shell-command <span style="color: #7984D1;">"numlockx on"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>shell-command <span style="color: #7984D1;">"xinput set-prop \"SynPS/2 Synaptics TouchPad\" \"libinput Tapping Enabled\" 1"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">when</span> <span style="color: #a7da1e;">(</span>executable-find <span style="color: #7984D1;">"flameshot"</span><span style="color: #a7da1e;">)</span>
    <span style="color: #a7da1e;">(</span>start-process-shell-command <span style="color: #7984D1;">"flameshot"</span> nil <span style="color: #7984D1;">"flameshot"</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>

<p>
Instead of using <code>scrot</code> for screenshots, I prefer to use Flameshot.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">when</span> <span style="color: #ff2afc;">(</span>executable-find <span style="color: #7984D1;">"flameshot"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>start-process-shell-command <span style="color: #7984D1;">"flameshot"</span> nil <span style="color: #7984D1;">"flameshot"</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
</div>
