modules/exwm/freemacs-exwm.el
  (require 'exwm-randr)
  (exwm-randr-enable)
  (require 'exwm-systemtray)
  (exwm-systemtray-enable)
  (whicher "nm-applet")
  (when (executable-find "nm-applet")
    (start-process-shell-command "nm-applet" nil "nm-applet"))
  (whicher "pasystray")
  (when (executable-find "pasystray")
    (start-process-shell-command "pasystray" nil "pasystray"))
  (whicher "xsettingsd")
  (when (executable-find "xsettingsd")
    (start-process-shell-command "xsettingsd" nil "xsettingsd"))
  (exwm-init))

(use-package desktop-environment
  :straight nil
  :after exwm
  :init
  (mapc #'whicher '("amixer"
                    "brightnessctl"
                    "numlockx"
                    "scrot"
                    "slock"
                    "upower"
                    "TLP"
                    "playerctl"))
  :config
  (desktop-environment-mode)
  (shell-command "pulseaudio --kill ; pulseaudio --start")
  (shell-command "numlockx on")
  (shell-command "xinput set-prop \"SynPS/2 Synaptics TouchPad\" \"libinput Tapping Enabled\" 1")
  (when (executable-find "flameshot")
    (start-process-shell-command "flameshot" nil "flameshot")))
