modules/exwm/freemacs-exwm.org
* End

#+begin_src emacs-lisp :tangle yes
  (provide 'freemacs-exwm)

  ;;; freemacs-exwm.el ends here
#+end_src
