modules/exwm/freemacs-exwm.el

(provide 'freemacs-exwm)

;;; freemacs-exwm.el ends here
